Public Member Functions | List of all members
ACAPI::EditNotificationInterface Class Referenceabstract
Notifications Manager
EditNotificationInterface is responsible for handling Edit Notifications through API. You can make your own notification implementation, which will be executed after element editings. More...
#include <EditNotificationInterface.hpp>
 Inheritance diagram for ACAPI::EditNotificationInterface:
 Public Member Functions
EditNotificationInterface ()
Constructs a new Edit Notification Interface.
virtual void  | ElementsEdited (const GS::HashSet< API_Guid > &changedItemGuids, const API_ActTranPars &actTranPars)=0
The callback to be overridden in your implementation. This is called, when elements are edited.
 Public Member Functions inherited from ACAPI::AddonNotificationInterface
AddonNotificationInterface (const API_Guid &notificationIdentifier)
Creates and registers the AddonNotificationInterface.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::AddonNotificationInterface
 const API_Guid  | notificationIdentifier
Identifier given by constructor.
Detailed Description
EditNotificationInterface is responsible for handling Edit Notifications through API. You can make your own notification implementation, which will be executed after element editings.
Since
Archicad 29
Member Function Documentation
◆ ElementsEdited()
 virtual void ACAPI::EditNotificationInterface::ElementsEdited  |  ( |  const GS::HashSet< API_Guid > & |  changedItemGuids,
|  const API_ActTranPars & |  actTranPars )
pure virtual
The callback to be overridden in your implementation. This is called, when elements are edited.
Parameters
changedItemGuids | The changed item guids during the editing.
actTranPars | The transformation parameters of the editing.